using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace LAB2D
{
    public class NameGenertor : Singleton<NameGenertor>
    {
        // 预定义的名字列表
        private static readonly List<string> FirstNames = new List<string>
        {
            "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨",
            "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜",
            "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",
            "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐",
            "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
            "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄",
            "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧",
            "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁",
        };

        // 预定义的姓氏列表
        private static readonly List<string> LastNames = new List<string>
        {
            "伟", "刚", "勇", "毅", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "明", "永",
            "健", "世", "广", "志", "义", "兴", "良", "海", "山", "仁", "波", "宁", "贵", "福", "生", "龙",
            "元", "全", "国", "胜", "学", "祥", "才", "发", "武", "新", "利", "清", "飞", "彪", "宏", "德",
            "光", "天", "达", "安", "岩", "中", "茂", "进", "林", "有", "坚", "和", "彬", "柏", "杉", "柯",
            "树", "振", "茂", "进", "林", "有", "坚", "和", "敬", "柏", "新", "彬", "富", "顺", "信", "子",
            "豪", "学", "祥", "才", "俊", "峰", "强", "军", "平", "保", "东", "文", "辉", "力", "世", "广",
            "伟才", "刚豪", "毅武", "俊彦", "峰丞", "强志", "军翔", "平瀚", "保乐", "东瑜", "文昊", "辉彤",
            "力言", "明轩", "永瑜", "健柏", "世杰", "广君", "志泽", "义博", "兴庆", "良骅", "海瀚", "山彤",
            "仁俊", "波鸿", "宁康", "贵博", "福宸", "生鹏", "龙德", "元恺", "全智", "国兴", "胜杰", "学义",
            "祥熙", "才俊", "发祥", "武彤", "新翰", "利锋", "清瑜", "飞宇", "彪瑞", "宏才", "德宇", "光熙",
            "天逸", "达安", "岩豪", "中震", "茂霖", "进德", "林泽", "有杰", "坚诚", "和泰", "敬曦", "柏宸",
            "新曦", "彬郁", "富哲", "顺庆", "信鸥", "子轩", "豪宸", "学义", "祥杰", "才良", "俊驰", "峰瑜",
        };

        // 生成随机姓名的方法
        public string getRandomName()
        {
            int surnameIndex = Random.Range(0, LastNames.Count);
            int firstNameIndex = Random.Range(0, FirstNames.Count);

            return FirstNames[firstNameIndex] + LastNames[surnameIndex];
        }
    }
}
